{"documents": ["The gym exercise tracking dataset contains 973 recorded workout sessions from gym members. This data captures demographics, biometrics, and workout performance for each session. Member ages range from 18.0 to 59.0 years (average 38.7). Average body weight is 73.9 kg. Average BMI is 24.9.", "Workout type '0': 255 sessions (26.2% of total). Average calories burned: 884.5 kcal (range 303.0-1625.0). Average session duration: 1.2 hours. Average heart rate: 143.9 BPM. Average member age: 37.7 years. Average experience level: 1.7 (1=beginner, 2=intermediate, 3=advanced).", "Workout type '1': 221 sessions (22.7% of total). Average calories burned: 925.8 kcal (range 333.0-1766.0). Average session duration: 1.3 hours. Average heart rate: 143.5 BPM. Average member age: 38.9 years. Average experience level: 1.8 (1=beginner, 2=intermediate, 3=advanced).", "Workout type '2': 258 sessions (26.5% of total). Average calories burned: 910.7 kcal (range 350.0-1783.0). Average session duration: 1.3 hours. Average heart rate: 144.3 BPM. Average member age: 38.9 years. Average experience level: 1.8 (1=beginner, 2=intermediate, 3=advanced).", "Workout type '3': 239 sessions (24.6% of total). Average calories burned: 903.2 kcal (range 330.0-1582.0). Average session duration: 1.3 hours. Average heart rate: 143.3 BPM. Average member age: 39.2 years. Average experience level: 1.9 (1=beginner, 2=intermediate, 3=advanced).", "Calorie burn statistics across all workouts: average 905.4 kcal per session, minimum 303.0 kcal, maximum 1783.0 kcal, median 893.0 kcal. Higher calorie burns correlate with longer session durations and higher heart rates.", "Beginner members (376 sessions, 38.6%): avg calories 726.4, avg body fat 27.6%, avg water intake 2.5 liters.", "Intermediate members (406 sessions, 41.7%): avg calories 901.9, avg body fat 27.3%, avg water intake 2.5 liters.", "Advanced members (191 sessions, 19.6%): avg calories 1265.3, avg body fat 14.8%, avg water intake 3.1 liters.", "BMI distribution: average 24.9, min 12.3, max 49.8. Underweight (<18.5): 168 members, Normal (18.5-25): 370 members, Overweight (25-30): 243 members, Obese (30+): 192 members.", "Water intake across members: average 2.6 liters per day. Range: 1.5 to 3.7 liters. Recommended hydration is 2.5-3.5 liters for active gym members.", "The daily gym attendance dataset has 2600 visit records capturing member check-ins, workout details, and attendance patterns. Member ages range from 18.0 to 65.0. Average workout duration is 70.2 minutes.", "Membership type '0': 903 visits (34.7%). Avg workout duration: 69.9 min. Avg calories burned: 521.5. Avg adherence score: 0.5.", "Membership type '1': 856 visits (32.9%). Avg workout duration: 69.2 min. Avg calories burned: 511.5. Avg adherence score: 0.5.", "Membership type '2': 841 visits (32.3%). Avg workout duration: 71.4 min. Avg calories burned: 538.7. Avg adherence score: 0.5.", "Gym attendance by day of week: Monday: 384 visits (14.8%) Tuesday: 368 visits (14.2%) Wednesday: 374 visits (14.4%) Thursday: 325 visits (12.5%) Friday: 392 visits (15.1%) Saturday: 383 visits (14.7%) Sunday: 374 visits (14.4%).", "Churn risk analysis: 1250 members (48.1%) flagged as at-risk for leaving the gym. 1350 members (51.9%) have healthy attendance patterns. At-risk members have an average adherence score of 0.0 vs 1.0 for stable members.", "The body performance dataset contains 13393 physical fitness assessments. Age range: 21.0-64.0 years. Metrics include grip force, sit-ups, broad jump, flexibility, blood pressure, and body fat percentage. Performance is classified into classes (A=excellent through D=needs improvement).", "Performance class '0' (3348 members, 25.0%): avg grip force 38.6 kg, avg sit-ups 47.8, avg broad jump 202.7 cm, avg flexibility 21.4 cm, avg body fat 20.5%, avg blood pressure 129.3/77.9 mmHg.", "Performance class '1' (3347 members, 25.0%): avg grip force 37.9 kg, avg sit-ups 42.6, avg broad jump 195.3 cm, avg flexibility 17.5 cm, avg body fat 22.0%, avg blood pressure 130.6/78.7 mmHg.", "Performance class '2' (3349 members, 25.0%): avg grip force 36.6 kg, avg sit-ups 38.7, avg broad jump 188.6 cm, avg flexibility 14.4 cm, avg body fat 22.6%, avg blood pressure 129.9/78.6 mmHg.", "Performance class '3' (3349 members, 25.0%): avg grip force 34.7 kg, avg sit-ups 29.9, avg broad jump 173.8 cm, avg flexibility 7.6 cm, avg body fat 27.7%, avg blood pressure 131.1/80.1 mmHg.", "Performance score distribution: 25th percentile = -0.48, median = 0.04, 75th percentile = 0.53. Scores above 0.53 indicate elite fitness. Below -0.48 suggests significant room for improvement.", "Blood pressure across members: average systolic 130.2 mmHg, average diastolic 78.8 mmHg. Normal: < 120/80. Elevated: 120-129/<80. High Stage 1: 130-139/80-89. High Stage 2: ≥140/≥90.", "The calorie burning dataset contains 15000 exercise records with heart rate, duration, body temperature, and calories burned. Duration ranges from 1.0 to 30.0 minutes (avg 15.5). Average calories burned: 89.5 kcal. Average heart rate during exercise: 95.5 BPM.", "For short (0-10 min) exercises (4335 records): average calorie burn is 21.4 kcal, average heart rate 85.4 BPM.", "For medium (10-20 min) exercises (5275 records): average calorie burn is 74.6 kcal, average heart rate 94.6 BPM.", "For long (20-30 min) exercises (5135 records): average calorie burn is 156.5 kcal, average heart rate 104.3 BPM.", "Heart rate zone 'light' (60-100 BPM, 9581 records): average calorie burn 52.6 kcal over 11.0 min average duration.", "Heart rate zone 'moderate' (100-140 BPM, 5419 records): average calorie burn 154.8 kcal over 23.5 min average duration.", "Fitbit wearable data: 940 daily activity records from gym members' fitness trackers. Average daily steps: 7637.9. Average daily calories: 2303.6 kcal. Average sedentary minutes: 991.2 min/day.", "Daily step count: average 7637.9, min 0.0, max 36019.0. WHO recommends 8000-10000 steps/day. Members above 10000 steps: 303 (32.2%). Members below 5000 steps (sedentary): 303 (32.2%).", "ML Model 'workout_recommender' (LightGBM classifier): trained on 778 samples, tested on 195 samples. Performance metrics: f1_weighted=0.2593, roc_auc_ovr=0.5143. Uses 19 features: age, gender, weight_kg, height_m, max_bpm, avg_bpm, resting_bpm, session_duration_hours, calories_burned, fat_percentage….", "ML Model 'calorie_predictor' (LightGBM regressor): trained on 12000 samples, tested on 3000 samples. Performance metrics: mae=0.6026, rmse=1.0439. Uses 15 features: user_id, gender, age, height, weight, duration, heart_rate, body_temp, member_id_x, _source_x….", "ML Model 'adherence_predictor' (XGBoost classifier): trained on 2080 samples, tested on 520 samples. Performance metrics: f1=1.0, roc_auc=1.0. Uses 15 features: age, gender, membership_type, workout_type, workout_duration_minutes, calories_burned, check_in_time, attendance_status, day_of_week, month….", "ML Model 'progress_forecaster' (XGBoost regressor): trained on 10714 samples, tested on 2679 samples. Performance metrics: mae=0.0249, rmse=0.0923. Uses 15 features: age, gender, height_cm, weight_kg, body_fat, diastolic, systolic, gripforce, sit_and_bend_forward_cm, sit_ups_counts….", "HIIT (High-Intensity Interval Training) alternates between intense bursts and rest periods. Burns 400-600 calories in 30 minutes. Best for fat loss, cardiovascular fitness, and metabolic boost. Recommended 2-3 times per week with rest days between sessions.", "Strength training builds muscle mass, increases bone density, and boosts metabolism. For beginners: 3 sets of 8-12 reps. Intermediate: 4 sets of 6-10 reps. Advanced: 5+ sets with progressive overload. Major compound exercises: squat, deadlift, bench press, overhead press, barbell row.", "Yoga improves flexibility, balance, and mental well-being. Burns 200-400 calories per hour. Types: Hatha (beginner-friendly), Vinyasa (flow-based), Ashtanga (intense), Yin (passive stretching). Recommended 2-4 times per week as active recovery or primary workout.", "Cardio exercise includes running, cycling, swimming, and elliptical training. Zone 2 cardio (60-70% max heart rate) is optimal for fat burning and endurance building. Max heart rate estimate: 220 minus age. Target 150-300 minutes of moderate cardio per week.", "For muscle building: consume 1.6-2.2g protein per kg bodyweight daily. Caloric surplus of 200-500 kcal above maintenance for lean bulk. Good protein sources: chicken breast (31g/100g), eggs (13g/100g), Greek yogurt (10g/100g), whey protein (80g/100g).", "For fat loss: create a caloric deficit of 300-500 kcal below maintenance. Maintenance calories ≈ bodyweight (kg) × 30-33. Prioritize protein (prevents muscle loss), eat fiber-rich foods for satiety, drink 2-3 liters of water daily.", "Rest and recovery are critical for progress. Muscles grow during rest, not during workouts. Sleep 7-9 hours per night. Sleep deprivation reduces strength by 10-15% and increases injury risk. Active recovery (light walking, stretching) is better than complete rest on off days.", "Progressive overload is the fundamental principle of fitness improvement. Increase weight by 2-5% when you can complete all target reps with good form. Alternatively: increase reps, sets, time under tension, or decrease rest periods. Track your workouts to ensure progressive overload is happening.", "Heart rate training zones: Zone 1 (50-60% max HR) = very light warmup. Zone 2 (60-70%) = fat burning, endurance. Zone 3 (70-80%) = aerobic capacity. Zone 4 (80-90%) = anaerobic threshold, lactate. Zone 5 (90-100%) = maximum effort, sprint intervals.", "Common gym mistakes: not warming up (5-10 min dynamic stretching recommended), skipping compound movements for isolation exercises, not tracking workouts, overtraining without adequate rest, poor hydration, inconsistent attendance. Consistency beats intensity — 3 good sessions per week outperforms 6 mediocre ones.", "Evidence-based supplements: creatine monohydrate (5g daily, well-researched for strength and power), caffeine (3-6mg/kg bodyweight pre-workout for performance), whey protein (convenient protein source), vitamin D (if deficient, common in indoor exercisers), omega-3 (anti-inflammatory, heart health).", "Body fat percentage categories — Men: Essential (2-5%), Athletes (6-13%), Fitness (14-17%), Average (18-24%), Obese (25%+). Women: Essential (10-13%), Athletes (14-20%), Fitness (21-24%), Average (25-31%), Obese (32%+)."], "metadata": [{"category": "gym_exercise", "source": "overview"}, {"category": "gym_exercise", "source": "workout_0"}, {"category": "gym_exercise", "source": "workout_1"}, {"category": "gym_exercise", "source": "workout_2"}, {"category": "gym_exercise", "source": "workout_3"}, {"category": "gym_exercise", "source": "calories"}, {"category": "gym_exercise", "source": "experience_1"}, {"category": "gym_exercise", "source": "experience_2"}, {"category": "gym_exercise", "source": "experience_3"}, {"category": "gym_exercise", "source": "bmi"}, {"category": "gym_exercise", "source": "hydration"}, {"category": "daily_attendance", "source": "overview"}, {"category": "daily_attendance", "source": "membership_0"}, {"category": "daily_attendance", "source": "membership_1"}, {"category": "daily_attendance", "source": "membership_2"}, {"category": "daily_attendance", "source": "day_patterns"}, {"category": "daily_attendance", "source": "churn"}, {"category": "body_performance", "source": "overview"}, {"category": "body_performance", "source": "class_0"}, {"category": "body_performance", "source": "class_1"}, {"category": "body_performance", "source": "class_2"}, {"category": "body_performance", "source": "class_3"}, {"category": "body_performance", "source": "performance_dist"}, {"category": "body_performance", "source": "blood_pressure"}, {"category": "calories", "source": "overview"}, {"category": "calories", "source": "duration_short (0-10 min)"}, {"category": "calories", "source": "duration_medium (10-20 min)"}, {"category": "calories", "source": "duration_long (20-30 min)"}, {"category": "calories", "source": "hr_zone_light"}, {"category": "calories", "source": "hr_zone_moderate"}, {"category": "fitbit", "source": "overview"}, {"category": "fitbit", "source": "steps"}, {"category": "model_info", "source": "workout_recommender"}, {"category": "model_info", "source": "calorie_predictor"}, {"category": "model_info", "source": "adherence_predictor"}, {"category": "model_info", "source": "progress_forecaster"}, {"category": "fitness_knowledge", "source": "knowledge_0"}, {"category": "fitness_knowledge", "source": "knowledge_1"}, {"category": "fitness_knowledge", "source": "knowledge_2"}, {"category": "fitness_knowledge", "source": "knowledge_3"}, {"category": "fitness_knowledge", "source": "knowledge_4"}, {"category": "fitness_knowledge", "source": "knowledge_5"}, {"category": "fitness_knowledge", "source": "knowledge_6"}, {"category": "fitness_knowledge", "source": "knowledge_7"}, {"category": "fitness_knowledge", "source": "knowledge_8"}, {"category": "fitness_knowledge", "source": "knowledge_9"}, {"category": "fitness_knowledge", "source": "knowledge_10"}, {"category": "fitness_knowledge", "source": "knowledge_11"}]}